Revit 2027 API
IDirectContext3DServer.GetSourceId Method
 Reports this server's source ID.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
string GetSourceId()
Function GetSourceId As String
String^ GetSourceId()
abstract GetSourceId : unit -> string
Return Value
String
 The source ID.
See Also
Reference
IDirectContext3DServer Interface
Autodesk.Revit.DB.DirectContext3D Namespace